# Пользователь вводит год.
# Если введённый год високосный - выведите True, иначе - False.

user_year = int(input('Year: '))
print(user_year % 4 == 0)

